frontend/controllers/MessageController.php

SELECT `username` FROM `user` WHERE `id`='1'
---
    public function actionView($id)
    {
        $model = $this->findModel($id);
        $admin  = \backend\models\User::find()->select("username")->andWhere(['id' => $model->admin_id])->one();

INSERT INTO `message` (`message`, `user_id`, `add_time`, `status`) VALUES ('士大夫撒旦\r\nsdfsad', '4', '1556099709', 0)
---
    public function actionCreate()
    {
        Yii::$app->language = 'zh-CN';
        $model = new message();
        if ($model->load(Yii::$app->request->post())) {
            $model->user_id  = $this->user_id;
            $model->add_time = time();
            $model->status   = 0;
            $model->save();