common/models/User.php

    public static function findByUsername($username)
    {
        $map = ['username' => $username, 'status' => self::STATUS_ACTIVE];
        if(isset($_POST['LoginForm']['role'])){
           $map["role"] = $_POST['LoginForm']['role'];
        }
        return static::findOne($map);
---
SELECT * FROM `user` WHERE (`username`='小希') AND (`status`=10)