frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();
        return $user->save() && $this->sendEmail($user);
---
INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `verification_token`, `status`, `created_at`, `updated_at`) VALUES ('周家', '17526459908@qq.com', '$2y$13$cd8Hfy/iMNm7ayxTmqK7tO3XYJSg3Siw6VoAp4ywIckxb5MLk4tbG', '8HnJf_BZlKseaimFzvcIsLOncYpu7yhy', 'SZAVHFkyni1U3O3mmoQRXq4hGcq-QB2C_1556099408', 10, 1556099408, 1556099408)